<template>
  <div class="sorting-rules">
    <h1 class="heading">
      Правила сортировки отходов
    </h1>
    <p class="text">
      Во многих странах отходы собираются раздельно. Содержимое контейнеров для пластика, 
      бумаги и стекла отправляется на досортировку и переработку, 
      мусор из общих контейнеров везут на свалку. 
      Опасные отходы — батарейки, лекарства, ртутные и люминисцентные лампы и другие 
      отходы собираются отдельно в специальные контейнеры, чтобы они не попадали в общий мусор.
    </p>
    <div
      v-for="trash in trashes"
      :key="trash.title"
      class="trash"
    >
      <img
        class="trash-img"
        :src="trash.img"
        :alt="trash.title"
      >
      <div class="trash-detail">
        <h2
          class="trash-detail__title"
          :style="`--color: ${trash.color};`"
        >
          {{ trash.title }}
        </h2>
        <div class="lists-wrapper">
          <ul class="items-list">
            <p class="items-list__subtitle">
              Можно выбрасывать:
            </p>
            <li
              v-for="item in trash.itemsToDrop"
              :key="item"
              class="item"
            >
              {{ item }}
            </li>
          </ul>

          <ul class="items-list bad">
            <p class="items-list__subtitle">
              Нельзя выбрасывать:
            </p>
            <li
              v-for="item in trash.itemsNotToDrop"
              :key="item"
              class="item"
            >
              {{ item }}
            </li>
          </ul>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import trashGlass from '@/assets/images/trash-glass.png'
import trashOrganic from '@/assets/images/trash-other.png'
import trashPaper from '@/assets/images/trash-paper.png'
import trashPlastic from '@/assets/images/trash-plastic.png'

const trashes = [
  {
    color: '#0069b7',
    title: 'Бумага',
    img: trashPaper,
    itemsToDrop: [
      'Старые документы',
      'Газеты',
      'Журналы',
      'Цветная бумага',
      'Картон',
      'Тетради',
      'Книги',
      'Альбомы',
      'Бумажные пакеты',
      'Картонные контейнеры для яиц',
      'Коробки от косметики',
      'Коробки от конфет'
    ],
    itemsNotToDrop: [
      'Грязные коробки от пиццы',
      'Одноразовая бумажная посуда',
      'Факсы',
      'Чеки',
      'Фотографии на фотобумаге',
      'Салфетки',
      'Туалетная бумага',
      'Бумажные полотенца',
      'Бумага, покрытая пленкой, металлическим слоем',
      'Упаковка от соков и молока',
      'Пергамент и пергаментная бумага'
    ]
  },
  {
    color: '#ff7c00',
    title: 'Пластик',
    img: trashPlastic,
    itemsToDrop: [
      'Пакеты от молока (перерабатываются частично)',
      'Бутылки из-под масла',
      'Бутылки от напитков, молока и пр.',
      'Упаковка от яиц с маркировкой «1»',
      'Пластиковые крышечки',
      'Бутылки от шампуней, жидкого мыла, гелей для душа',
      'Бутылки от бытовой химии, моющих средств',
      'Пакеты с ручками, пакеты-майки',
      'Фасовочные пакеты',
      'Пенопластовые изделия',
      'Пластиковые вёдра',
      'Канистры',
      'Упаковка от соков и молока',
      'Алюминиевые банки',
      'Упаковка от консерв'
    ],
    itemsNotToDrop: [
      'Одноразовая посуда (все маркировки)',
      'Белые баночки от сметаны и йогуртов',
      'Лотки от яиц',
      'Зубные щётки',
      'Памперсы',
      'Прокладки',
      'Тампоны',
      'Тюбики от зубной пасты, кремов',
      'Мягкая упаковка от майонеза, кетчупа',
      'Обёртки от конфет и батончиков',
      'Упаковка от чипсов',
      'Фольга',
      'СD диски',
      'Магнитофонные кассеты',
      'Ненужная декоративная косметика',
      'Фасовочные пакеты с остатками пищи. Сильно загрязненные пакеты'
    ]
  },
  {
    color: '#008d00',
    title: 'Стекло',
    img: trashGlass,
    itemsToDrop: [
      'Бутылки от напитков и пива',
      'Бутылки от вина и шампанского',
      'Бутылки от крепкого алкоголя',
      'Стеклянные банки от соков и закаток',
      'Стеклянные баночки от детского питания',
      'Баночки от лекарств'
    ],
    itemsNotToDrop: [
      'Оконное и мебельное стекло',
      'Лампочки',
      'Зеркала',
      'Стеклянная посуда',
      'Хрусталь',
      'Керамика и фарфор'
    ]
  },
  {
    color: '#464949',
    title: 'Общий мусор',
    img: trashOrganic,
    itemsToDrop: [
      'Органические отходы (если дома нет компостера)',
      'Фасовочные пакеты с остатками пищи',
      'Чеки',
      'Использованные обои',
      'Фасовочные пакеты с остатками пищи. Сильно загрязненные пакеты',
      'Комбинированные упаковки',
      'Флоу-пак (от шоколадок, круп, мороженого и т.п.)',
      'Одноразовая посуда, трубочки и контейнеры для еды',
      'Бумага, покрытая пленкой, металлическим слоем',
      'Памперсы',
      'Сломанные детские игрушки',
      'Упаковка от глазированных сырков',
      'Баночки от сметаны и йогурта',
      'Тюбик от зубной пасты',
      'Пакет от чипсов',
      'Зубная щетка',
      'Канцелярские принадлежности',
      'Упаковка из-под кетчупа и майонеза',
      'Салфетки',
      'Сигаретные окурки'
    ],
    itemsNotToDrop: [
      'Многоразовые аккумуляторы',
      'Батарейки',
      'Градусники',
      'Ртутные лампы',
      'Мобильный телефон',
      'Компьютер',
      'Монитор',
      'Ноутбук',
      'Планшет',
      'Фен',
      'Фотоаппарат',
      'Бытовая техника',
      'Лекарства',
      'Автомобильные отходы'
    ]
  }
]
</script>

<style lang="scss" scoped>
@import 'SortingRules';
</style>
